[
  {
    "name": "Phở bò",
    "calories": 500,
    "protein": 30,
    "carbs": 50,
    "fat": 10,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Phở bò is a quintessential Vietnamese noodle soup, celebrated for its fragrant, slow-simmered beef bone broth infused with star anise, cinnamon, and cloves. It features delicate rice noodles, tender beef slices, and fresh herbs like basil, cilantro, and mint. Served with bean sprouts, lime, and chili, this protein-rich dish is a comforting meal, often enjoyed for breakfast or lunch in Vietnam, balancing bold flavors with nourishing ingredients."
  },
  {
    "name": "Cơm gà",
    "calories": 600,
    "protein": 40,
    "carbs": 65,
    "fat": 12,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Cơm gà, or Vietnamese chicken rice, is a beloved dish featuring fluffy jasmine rice steamed to perfection and paired with succulent poached or roasted chicken. Infused with subtle flavors from ginger and pandan leaves, it’s served with crisp cucumber, fresh herbs, and a tangy chili sauce. This wholesome meal, popular across Southeast Asia, provides a balanced mix of carbs and protein, ideal for a hearty lunch or dinner."
  },
  {
    "name": "Salad",
    "calories": 200,
    "protein": 5,
    "carbs": 20,
    "fat": 8,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "This vibrant salad combines crisp leafy greens, juicy cherry tomatoes, crunchy cucumbers, shredded carrots, and red onions, all tossed in a light dressing of extra virgin olive oil and balsamic vinegar. Packed with vitamins, minerals, and fiber, it’s a low-calorie snack perfect for health-conscious eaters. Its refreshing crunch complements any meal or serves as a standalone light bite, popular in Western and Mediterranean diets."
  },
  {
    "name": "Trứng luộc",
    "calories": 150,
    "protein": 13,
    "carbs": 1,
    "fat": 11,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Trứng luộc, or hard-boiled eggs, are a simple yet nutrient-dense snack in Vietnamese cuisine and beyond. Each serving delivers high-quality protein and healthy fats, supporting muscle recovery and sustained energy. Easy to prepare and portable, they’re versatile for breakfast, snacks, or as a topping for salads and ramen, with a creamy yolk adding richness to every bite."
  },
  {
    "name": "Brown Rice",
    "calories": 110,
    "protein": 2.5,
    "carbs": 23,
    "fat": 1,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Brown rice, a whole grain staple, retains its nutrient-rich bran and germ, offering a nutty flavor and chewy texture. Rich in fiber, magnesium, and B vitamins, it’s a healthier alternative to white rice, perfect for stir-fries, grain bowls, or casseroles. Widely used in global cuisines, from Asian to Mediterranean, it’s a versatile ingredient for balanced, nutrient-packed meals."
  },
  {
    "name": "Grilled Salmon",
    "calories": 280,
    "protein": 25,
    "carbs": 0,
    "fat": 20,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Grilled salmon is a succulent dish featuring a fillet seasoned with fresh herbs, lemon zest, and olive oil, seared to achieve a crispy exterior and tender, flaky interior. Rich in omega-3 fatty acids, protein, and vitamin D, it supports heart health and is a staple in many cuisines. Often paired with roasted vegetables or a light salad, it’s a flavorful, nutrient-dense meal."
  },
  {
    "name": "Almonds",
    "calories": 579,
    "protein": 21,
    "carbs": 22,
    "fat": 50,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Roasted almonds are a crunchy, nutrient-dense snack packed with monounsaturated fats, vitamin E, magnesium, and fiber. Originating from the Middle East, their nutty flavor makes them ideal for on-the-go snacking, trail mixes, or topping yogurt and salads. These superfood nuts support heart health and provide sustained energy, making them a favorite for health-conscious eaters worldwide."
  },
  {
    "name": "Sushi Roll",
    "calories": 300,
    "protein": 12,
    "carbs": 50,
    "fat": 5,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Sushi rolls, a Japanese delicacy, feature vinegared rice, fresh fish like tuna or salmon, and crisp vegetables wrapped in nori seaweed. Served with soy sauce, wasabi, and pickled ginger, they offer a harmonious balance of flavors and textures. High in protein and omega-3s, sushi is a light yet satisfying meal, celebrated globally for its elegance and fresh, clean taste."
  },
  {
    "name": "Chicken Breast",
    "calories": 165,
    "protein": 31,
    "carbs": 0,
    "fat": 3.6,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Lean chicken breast is a high-protein, low-fat ingredient prized for its versatility in global cuisines. Whether grilled, baked, or stir-fried, it absorbs flavors beautifully, making it a staple in salads, curries, and sandwiches. Rich in B vitamins and amino acids, it’s a go-to choice for fitness enthusiasts and home cooks seeking healthy, muscle-building meals."
  },
  {
    "name": "Greek Yogurt",
    "calories": 120,
    "protein": 10,
    "carbs": 8,
    "fat": 5,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Greek yogurt, a creamy, tangy dairy product, is strained to achieve a thick texture, packed with probiotics, protein, and calcium. Originating from Greece, it’s perfect for breakfast with fruit and honey, as a smoothie base, or as a healthy dessert. Its gut-friendly bacteria and rich nutrient profile make it a staple in Mediterranean diets and a versatile snack."
  },
  {
    "name": "Pad Thai",
    "calories": 600,
    "protein": 20,
    "carbs": 80,
    "fat": 15,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Pad Thai, a Thai street food classic, features stir-fried rice noodles with shrimp, tofu, or chicken, tossed with crunchy bean sprouts, scallions, and crushed peanuts. Flavored with a tangy tamarind sauce, fish sauce, and chili, it balances sweet, sour, and spicy notes. This vibrant, globally loved dish is a satisfying meal with bold flavors and varied textures."
  },
  {
    "name": "Avocado",
    "calories": 160,
    "protein": 2,
    "carbs": 9,
    "fat": 15,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Avocado, often called nature’s butter, is a creamy fruit from Central America, rich in heart-healthy monounsaturated fats, potassium, and fiber. Its mild, nutty flavor makes it ideal for guacamole, toast, smoothies, or salads. Packed with vitamins E and K, avocados are a staple in healthy diets, offering versatility and nutrition in countless dishes."
  },
  {
    "name": "Beef Stir-Fry",
    "calories": 450,
    "protein": 30,
    "carbs": 20,
    "fat": 25,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Beef stir-fry is a savory Asian-inspired dish featuring tender beef strips wok-fried with vibrant vegetables like bell peppers, broccoli, and carrots in a rich soy-based sauce. Served over rice or noodles, it’s a quick, protein-packed meal with a satisfying crunch. Its bold flavors and versatility make it a popular choice for weeknight dinners."
  },
  {
    "name": "Apple",
    "calories": 52,
    "protein": 0.3,
    "carbs": 14,
    "fat": 0.2,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "A crisp, juicy apple is a classic snack, offering natural sweetness, fiber, and antioxidants like vitamin C. Grown globally, it’s perfect eaten raw, sliced with peanut butter, or baked into desserts. Its portability and digestive health benefits make it a go-to choice for curbing hunger and maintaining energy throughout the day."
  },
  {
    "name": "Quinoa",
    "calories": 120,
    "protein": 4,
    "carbs": 21,
    "fat": 2,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Quinoa, a South American pseudocereal, is a nutrient-dense superfood with a complete protein profile, containing all nine essential amino acids. Its nutty flavor and fluffy texture make it ideal for salads, bowls, or as a rice substitute. Rich in fiber, magnesium, and iron, quinoa is a staple for plant-based and gluten-free diets worldwide."
  },
  {
    "name": "Spaghetti Bolognese",
    "calories": 700,
    "protein": 30,
    "carbs": 80,
    "fat": 20,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Spaghetti Bolognese is an Italian classic featuring al dente pasta coated in a rich, slow-cooked ragù of ground beef, tomatoes, onions, carrots, and herbs. Finished with Parmesan cheese, this hearty dish is a comforting favorite, offering a perfect balance of carbs, protein, and savory flavors, ideal for family dinners or gatherings."
  },
  {
    "name": "Peanut Butter",
    "calories": 590,
    "protein": 25,
    "carbs": 20,
    "fat": 50,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Peanut butter, made from ground roasted peanuts, is a creamy or crunchy spread packed with protein, healthy fats, and vitamin E. Its rich, nutty flavor is perfect for toast, smoothies, or baking, from cookies to savory sauces. A versatile pantry staple, it’s loved globally for its satisfying taste and nutritional benefits."
  },
  {
    "name": "Vegetable Soup",
    "calories": 150,
    "protein": 5,
    "carbs": 25,
    "fat": 3,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Vegetable soup is a comforting blend of seasonal vegetables like carrots, celery, potatoes, and zucchini, simmered in a flavorful broth. This low-calorie, nutrient-rich dish is packed with vitamins, minerals, and fiber, making it perfect for a light lunch or starter. Its versatility allows for endless variations, from hearty minestrone to light broth-based soups."
  },
  {
    "name": "Banana",
    "calories": 90,
    "protein": 1.1,
    "carbs": 23,
    "fat": 0.3,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "A ripe banana is a naturally sweet, creamy snack packed with potassium, vitamin B6, and quick-digesting carbs. Grown in tropical regions, it’s ideal for pre- or post-workout energy, smoothies, oatmeal, or desserts. Its portability and nutritional value make it a globally loved fruit for curbing hunger and boosting energy."
  },
  {
    "name": "Tofu",
    "calories": 76,
    "protein": 8,
    "carbs": 2,
    "fat": 4,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Tofu, made from pressed soybean curds, is a plant-based protein staple in Asian cuisine and beyond. Its mild flavor and spongy texture make it ideal for absorbing marinades in stir-fries, grilling, or blending into creamy desserts. Rich in iron and calcium, tofu is a versatile ingredient for vegan and vegetarian diets, offering endless culinary possibilities."
  },
  {
    "name": "Chicken Curry",
    "calories": 500,
    "protein": 35,
    "carbs": 30,
    "fat": 25,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Chicken curry is a fragrant Indian dish featuring tender chicken simmered in a spiced coconut milk sauce with ingredients like turmeric, cumin, and coriander. Served with rice or naan, it offers a rich, aromatic experience with a balance of protein and healthy fats, making it a comforting and flavorful meal enjoyed worldwide."
  },
  {
    "name": "Hummus",
    "calories": 166,
    "protein": 8,
    "carbs": 14,
    "fat": 10,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Hummus is a creamy Middle Eastern dip made from blended chickpeas, tahini, lemon juice, and garlic. Packed with protein, fiber, and healthy fats, it’s perfect as a dip for vegetables, pita bread, or as a spread in sandwiches. Its smooth texture and tangy flavor make it a versatile, nutrient-rich snack loved globally."
  },
  {
    "name": "Oatmeal",
    "calories": 380,
    "protein": 13,
    "carbs": 66,
    "fat": 7,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Oatmeal, made from rolled oats, is a warm, hearty breakfast dish often topped with fruits, nuts, or honey. Rich in fiber, particularly beta-glucan, it supports heart health and digestion. Its versatility allows for sweet or savory variations, making it a comforting, nutrient-dense meal enjoyed in many cultures for its sustaining energy."
  },
  {
    "name": "Broccoli",
    "calories": 35,
    "protein": 2.8,
    "carbs": 7,
    "fat": 0.4,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Broccoli, a nutrient-dense cruciferous vegetable, is packed with vitamins C and K, fiber, and antioxidants. Its vibrant green florets and crisp stalks are ideal for steaming, roasting, or stir-frying, adding crunch and nutrition to any dish. A staple in healthy diets, broccoli supports immunity and is versatile in global cuisines."
  },
  {
    "name": "Grilled Cheese Sandwich",
    "calories": 400,
    "protein": 15,
    "carbs": 35,
    "fat": 20,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "A grilled cheese sandwich is a classic comfort food featuring melted cheddar cheese between buttery, golden-toasted bread. Its gooey texture and rich flavor make it a quick, satisfying meal or snack. Popular in American cuisine, it’s often paired with tomato soup for a nostalgic, hearty dining experience."
  },
  {
    "name": "Walnuts",
    "calories": 654,
    "protein": 15,
    "carbs": 14,
    "fat": 65,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Walnuts, with their rich, buttery flavor, are a nutrient-packed snack loaded with omega-3 fatty acids, antioxidants, and vitamin E. Perfect for snacking, adding to salads, or baking into desserts, they support brain and heart health. Originating from Persia, walnuts are a versatile superfood enjoyed in cuisines worldwide."
  },
  {
    "name": "Lentils",
    "calories": 116,
    "protein": 9,
    "carbs": 20,
    "fat": 0.4,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Lentils, small but mighty legumes, are a protein-rich ingredient used in soups, stews, and salads across global cuisines. Available in green, red, and brown varieties, they’re packed with fiber, iron, and folate. Their earthy flavor and versatility make them a staple in vegetarian and vegan diets, from Indian dal to Mediterranean dishes."
  },
  {
    "name": "Pizza Margherita",
    "calories": 600,
    "protein": 20,
    "carbs": 70,
    "fat": 25,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Pizza Margherita, an Italian classic, features a thin crust topped with fresh tomato sauce, mozzarella cheese, and basil leaves. Its simple ingredients highlight the flavors of Italy, with a balance of carbs, protein, and fats. Baked to perfection, this iconic dish is a global favorite for its vibrant taste and cultural heritage."
  },
  {
    "name": "Spinach",
    "calories": 23,
    "protein": 2.9,
    "carbs": 3.6,
    "fat": 0.4,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Spinach, a leafy green powerhouse, is rich in iron, vitamin A, and antioxidants. Its mild flavor makes it perfect for salads, smoothies, or cooked dishes like sautés and curries. A staple in healthy diets, spinach supports bone health and immunity, and its versatility shines in cuisines from Mediterranean to Asian."
  },
  {
    "name": "Tacos",
    "calories": 450,
    "protein": 20,
    "carbs": 40,
    "fat": 20,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Tacos, a Mexican street food favorite, feature soft or crispy corn tortillas filled with seasoned beef, chicken, or fish, topped with salsa, cilantro, onions, and lime. Packed with protein and vibrant flavors, they’re a versatile, crowd-pleasing meal. Their customizable nature makes them a global hit for casual dining."
  },
  {
    "name": "Chia Seeds",
    "calories": 486,
    "protein": 17,
    "carbs": 42,
    "fat": 31,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Chia seeds, tiny nutritional powerhouses from Central America, are packed with fiber, omega-3s, and calcium. Their gel-like texture when soaked makes them ideal for puddings, smoothies, or as a vegan egg substitute in baking. Versatile and nutrient-dense, they’re a popular superfood in healthy diets worldwide."
  },
  {
    "name": "Caesar Salad",
    "calories": 350,
    "protein": 10,
    "carbs": 20,
    "fat": 25,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Caesar salad, a classic American dish, features crisp romaine lettuce, croutons, Parmesan cheese, and a creamy, tangy dressing made with anchovies, garlic, and lemon. Often topped with grilled chicken, it’s a flavorful, satisfying meal or side. Its rich dressing and crunchy texture make it a timeless favorite in Western cuisine."
  },
  {
    "name": "Sweet Potato",
    "calories": 86,
    "protein": 1.6,
    "carbs": 20,
    "fat": 0.1,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Sweet potatoes, vibrant orange tubers, are rich in beta-carotene, fiber, and vitamin A. Their natural sweetness shines in roasting, mashing, or frying, making them a versatile ingredient in dishes from fries to casseroles. Popular in global cuisines, they’re a nutritious choice for healthy, comforting meals."
  },
  {
    "name": "Fried Rice",
    "calories": 500,
    "protein": 15,
    "carbs": 70,
    "fat": 15,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Fried rice, a staple in Asian cuisine, features stir-fried rice with vegetables, eggs, and often chicken, shrimp, or pork, seasoned with soy sauce and sesame oil. Its savory, umami-rich flavor and versatility make it a go-to meal or side dish. Packed with carbs and protein, it’s a satisfying, quick option for any time of day."
  },
  {
    "name": "Blueberries",
    "calories": 57,
    "protein": 0.7,
    "carbs": 14,
    "fat": 0.3,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Blueberries, small but nutrient-packed berries, are loaded with antioxidants, vitamin C, and fiber. Their sweet-tart flavor makes them perfect for snacking, adding to yogurt, or baking into muffins. Grown widely in North America, they support heart health and cognitive function, making them a delicious, healthy choice."
  },
  {
    "name": "Beef Steak",
    "calories": 271,
    "protein": 25,
    "carbs": 0,
    "fat": 19,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "A juicy beef steak, grilled or pan-seared, is a protein-rich dish seasoned with simple salt, pepper, and herbs for maximum flavor. Whether ribeye, sirloin, or filet mignon, it’s a hearty meal often paired with potatoes or vegetables. Popular in Western cuisine, it’s a favorite for its rich taste and satisfying texture."
  },
  {
    "name": "Olive Oil",
    "calories": 884,
    "protein": 0,
    "carbs": 0,
    "fat": 100,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Extra virgin olive oil, a cornerstone of Mediterranean cuisine, is rich in monounsaturated fats and antioxidants. Its fruity, peppery flavor enhances salads, dressings, or cooking, from sautéing to drizzling over dishes. Known for heart health benefits, it’s a versatile, healthy fat used in kitchens worldwide."
  },
  {
    "name": "Spring Rolls",
    "calories": 200,
    "protein": 8,
    "carbs": 25,
    "fat": 8,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Spring rolls, a Vietnamese and Southeast Asian delicacy, feature rice paper wrapped around shrimp, pork, or vegetables, with fresh herbs like mint and cilantro. Served with peanut or fish sauce dipping, they’re a light, crunchy snack. High in protein and low in calories, they’re a refreshing, flavorful option."
  },
  {
    "name": "Salmon Sashimi",
    "calories": 180,
    "protein": 20,
    "carbs": 0,
    "fat": 10,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Salmon sashimi, a Japanese delicacy, features thinly sliced raw salmon served with soy sauce, wasabi, and pickled ginger. Its buttery texture and rich flavor make it a luxurious, protein-packed dish. High in omega-3s, it’s a healthy, elegant choice for sushi lovers and a staple in Japanese cuisine."
  },
  {
    "name": "Chickpeas",
    "calories": 164,
    "protein": 9,
    "carbs": 27,
    "fat": 2.6,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Chickpeas, a versatile legume, are a protein and fiber-rich ingredient used in hummus, curries, and salads. Their nutty flavor and firm texture make them ideal for roasting or cooking in stews. A staple in Middle Eastern and Indian cuisines, they’re a nutritious choice for plant-based diets."
  },
  {
    "name": "Pancakes",
    "calories": 350,
    "protein": 8,
    "carbs": 50,
    "fat": 12,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Pancakes, a breakfast favorite, are fluffy, golden cakes made from batter and cooked on a griddle, often topped with maple syrup, fruit, or whipped cream. Their soft texture and versatility make them a beloved comfort food in American and Western cuisines, perfect for a sweet, satisfying start to the day."
  },
  {
    "name": "Carrots",
    "calories": 41,
    "protein": 0.9,
    "carbs": 10,
    "fat": 0.2,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Carrots, vibrant orange root vegetables, are packed with beta-carotene, fiber, and vitamin A. Their sweet, crunchy texture is perfect for snacking, roasting, or adding to soups and salads. A versatile ingredient in global cuisines, they support eye health and add color and nutrition to any dish."
  },
  {
    "name": "Butter Chicken",
    "calories": 600,
    "protein": 30,
    "carbs": 20,
    "fat": 40,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Butter chicken, an Indian favorite, features tender chicken cooked in a creamy tomato sauce with butter, cream, and spices like garam masala and turmeric. Served with naan or rice, its rich, mildly spicy flavor is a global hit. High in protein, it’s a comforting, indulgent meal for curry lovers."
  },
  {
    "name": "Dark Chocolate",
    "calories": 604,
    "protein": 8,
    "carbs": 46,
    "fat": 43,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Dark chocolate, made from cocoa beans, is a rich, bittersweet treat packed with antioxidants, iron, and magnesium. Its intense flavor makes it perfect for snacking, baking, or pairing with fruit. Originating from Mesoamerica, it’s a healthy indulgence when consumed in moderation, supporting heart health and mood."
  },
  {
    "name": "Mashed Potatoes",
    "calories": 250,
    "protein": 5,
    "carbs": 35,
    "fat": 10,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Mashed potatoes, a comforting side dish, feature creamy, boiled potatoes blended with butter, milk, and seasoning. Their smooth texture and rich flavor make them a classic accompaniment to meats or gravies in Western cuisine. High in carbs, they’re a hearty, satisfying addition to any meal."
  },
  {
    "name": "Pumpkin Seeds",
    "calories": 559,
    "protein": 30,
    "carbs": 11,
    "fat": 49,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Pumpkin seeds, or pepitas, are nutrient-dense seeds rich in protein, magnesium, and healthy fats. Their nutty, crunchy texture is perfect for snacking, roasting, or topping salads and soups. Originating from the Americas, they’re a versatile superfood that supports heart health and adds texture to dishes."
  },
  {
    "name": "Tomato",
    "calories": 18,
    "protein": 0.9,
    "carbs": 3.9,
    "fat": 0.2,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Tomatoes, juicy and vibrant, are a versatile ingredient rich in lycopene, vitamin C, and antioxidants. Used in sauces, salads, or salsas, their sweet-tart flavor enhances dishes worldwide, from Italian to Mexican cuisines. A staple in healthy diets, they support heart health and add freshness to any recipe."
  },
  {
    "name": "Ramen",
    "calories": 450,
    "protein": 15,
    "carbs": 60,
    "fat": 15,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Ramen, a Japanese noodle soup, features springy wheat noodles in a savory broth, often with pork, seaweed, and boiled eggs. Its rich, umami flavor and customizable toppings make it a global comfort food. High in carbs and protein, ramen is a hearty, warming dish perfect for any season."
  },
  {
    "name": "Edamame",
    "calories": 121,
    "protein": 11,
    "carbs": 10,
    "fat": 5,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Edamame, young soybeans, are a Japanese snack steamed and lightly salted, offering a nutty flavor and firm texture. Rich in protein, fiber, and vitamins, they’re perfect for snacking or adding to salads. Popular in Asian cuisine, edamame is a healthy, plant-based option for quick bites."
  },
  {
    "name": "Mango",
    "calories": 60,
    "protein": 0.8,
    "carbs": 15,
    "fat": 0.4,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Mango, a tropical fruit, is juicy and sweet, packed with vitamin C, fiber, and antioxidants. Its vibrant flavor is perfect for snacking, smoothies, or salsas. Grown in regions like India and Southeast Asia, it’s a refreshing, healthy treat that supports immunity and adds brightness to any dish."
  },
  {
    "name": "Pork Belly",
    "calories": 518,
    "protein": 9,
    "carbs": 0,
    "fat": 53,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Pork belly, a rich and flavorful cut, is prized for its tender meat and crispy fat when roasted or braised. Used in dishes like Chinese red-braised pork or Korean samgyeopsal, it’s a versatile ingredient in global cuisines. High in fat, it adds depth and indulgence to hearty meals."
  },
  {
    "name": "Lasagna",
    "calories": 650,
    "protein": 30,
    "carbs": 60,
    "fat": 30,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Lasagna, an Italian classic, features layers of pasta, rich meat sauce, creamy béchamel, and melted mozzarella cheese. Baked until bubbly, it’s a hearty, comforting dish perfect for family gatherings. Its balance of carbs, protein, and fats makes it a satisfying, indulgent meal loved worldwide."
  },
  {
    "name": "Kale",
    "calories": 49,
    "protein": 4.3,
    "carbs": 9,
    "fat": 0.9,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Kale, a nutrient-dense leafy green, is packed with vitamins A, C, and K, as well as fiber and antioxidants. Its hearty texture is ideal for salads, smoothies, or baked chips. A superfood in Western diets, kale supports bone health and immunity, adding a vibrant, earthy flavor to dishes."
  },
  {
    "name": "Burrito",
    "calories": 600,
    "protein": 25,
    "carbs": 70,
    "fat": 20,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "A burrito, a Mexican favorite, features a flour tortilla wrapped around fillings like seasoned beef, rice, beans, cheese, and salsa. Its hearty, portable nature makes it a popular meal or snack. Packed with protein and carbs, it’s a satisfying, customizable dish enjoyed globally for its bold flavors."
  },
  {
    "name": "Flaxseeds",
    "calories": 534,
    "protein": 18,
    "carbs": 29,
    "fat": 42,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Flaxseeds, tiny seeds rich in omega-3s, fiber, and lignans, are a nutritional powerhouse. Their nutty flavor is perfect for sprinkling on yogurt, smoothies, or baking. Used in healthy diets, they support heart and digestive health, making them a versatile ingredient for plant-based and gluten-free recipes."
  },
  {
    "name": "Pho Ga",
    "calories": 450,
    "protein": 25,
    "carbs": 50,
    "fat": 8,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Pho Ga, a Vietnamese chicken noodle soup, features rice noodles in a fragrant chicken broth with shredded chicken, fresh herbs, and bean sprouts. Lighter than its beef counterpart, it’s a comforting, protein-rich meal. Served with lime and chili, it’s a flavorful, nourishing dish popular in Vietnam and beyond."
  },
  {
    "name": "Strawberries",
    "calories": 32,
    "protein": 0.7,
    "carbs": 8,
    "fat": 0.3,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Strawberries, juicy and sweet, are packed with vitamin C, fiber, and antioxidants. Perfect for snacking, smoothies, or desserts, their vibrant flavor is a global favorite. Grown widely, they support heart health and immunity, making them a delicious, healthy choice for any time of day."
  },
  {
    "name": "Egg Fried Rice",
    "calories": 400,
    "protein": 12,
    "carbs": 60,
    "fat": 12,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Egg fried rice, an Asian staple, features stir-fried rice with scrambled eggs, peas, carrots, and soy sauce. Its savory, umami flavor and simple preparation make it a versatile meal or side. High in carbs and protein, it’s a quick, satisfying dish enjoyed in Chinese and other Asian cuisines."
  },
  {
    "name": "Bell Peppers",
    "calories": 25,
    "protein": 1,
    "carbs": 6,
    "fat": 0.2,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Bell peppers, vibrant and crunchy, come in red, yellow, and green varieties, packed with vitamin C and antioxidants. Their sweet, mild flavor is ideal for stir-fries, salads, or stuffed dishes. A versatile ingredient in global cuisines, they add color and nutrition to any recipe."
  },
  {
    "name": "Banh Mi",
    "calories": 550,
    "protein": 20,
    "carbs": 70,
    "fat": 15,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Banh Mi, a Vietnamese sandwich, features a crusty baguette filled with meats like pork, pate, pickled carrots, cucumber, and cilantro. Its fusion of French and Vietnamese flavors creates a unique, satisfying meal. High in protein and carbs, it’s a popular street food enjoyed globally."
  },
  {
    "name": "Cashews",
    "calories": 553,
    "protein": 18,
    "carbs": 30,
    "fat": 44,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Cashews, creamy and nutty, are rich in protein, healthy fats, and minerals like magnesium. Perfect for snacking, blending into sauces, or topping stir-fries, they’re a versatile superfood. Originating from Brazil, cashews are a global favorite, supporting heart health and adding richness to dishes."
  },
  {
    "name": "Shrimp Stir-Fry",
    "calories": 350,
    "protein": 25,
    "carbs": 20,
    "fat": 15,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Shrimp stir-fry, an Asian-inspired dish, features plump shrimp wok-fried with colorful vegetables like snap peas and carrots in a savory garlic-soy sauce. Served over rice, it’s a quick, protein-packed meal with vibrant flavors. Its light yet satisfying nature makes it a popular choice for healthy dinners."
  },
  {
    "name": "Oats",
    "calories": 389,
    "protein": 13,
    "carbs": 66,
    "fat": 7,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Oats, a hearty whole grain, are rich in fiber, particularly beta-glucan, supporting heart health and digestion. Their nutty flavor is perfect for oatmeal, granola, or baking. A staple in Western diets, oats are versatile and nutritious, making them a go-to ingredient for healthy breakfasts and snacks."
  },
  {
    "name": "Guacamole",
    "calories": 200,
    "protein": 2,
    "carbs": 10,
    "fat": 18,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Guacamole, a Mexican dip, is made from mashed avocados, lime, cilantro, and onions, offering a creamy, tangy flavor. Rich in healthy fats and vitamins, it’s perfect with tortilla chips or as a topping for tacos. Its fresh, vibrant taste makes it a beloved snack in Latin American cuisine."
  },
  {
    "name": "Pork Chops",
    "calories": 250,
    "protein": 27,
    "carbs": 0,
    "fat": 15,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Pork chops, juicy and flavorful, are pan-seared or grilled with simple seasonings like garlic and herbs. High in protein and B vitamins, they’re a versatile main dish in Western cuisine, often paired with mashed potatoes or vegetables. Their tender texture makes them a comforting, hearty meal option."
  },
  {
    "name": "Zucchini",
    "calories": 17,
    "protein": 1.2,
    "carbs": 3.1,
    "fat": 0.3,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Zucchini, a mild summer squash, is low in calories and rich in vitamin C and fiber. Its versatile texture is perfect for grilling, spiralizing into noodles, or baking into breads. A staple in Mediterranean and healthy diets, zucchini adds lightness and nutrition to a variety of dishes."
  },
  {
    "name": "Chicken Noodle Soup",
    "calories": 300,
    "protein": 20,
    "carbs": 30,
    "fat": 8,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Chicken noodle soup, a classic comfort food, features tender chicken, egg noodles, and vegetables like carrots and celery in a savory broth. Its warming, healing qualities make it a go-to for colds or cozy meals. Popular in Western cuisine, it’s a balanced, nourishing dish for any season."
  },
  {
    "name": "Pistachios",
    "calories": 562,
    "protein": 20,
    "carbs": 28,
    "fat": 45,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Pistachios, with their vibrant green hue and nutty flavor, are packed with protein, fiber, and healthy fats. Perfect for snacking, salads, or desserts, they’re a nutrient-dense superfood. Originating from the Middle East, pistachios support heart health and are a delicious, satisfying addition to any diet."
  },
  {
    "name": "Coconut Milk",
    "calories": 230,
    "protein": 2,
    "carbs": 6,
    "fat": 24,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Coconut milk, a creamy liquid from grated coconut, is rich in healthy fats and adds a tropical flavor to curries, soups, and desserts. Widely used in Southeast Asian and Caribbean cuisines, it’s a versatile ingredient for vegan and dairy-free recipes, enhancing dishes with its smooth, rich texture."
  },
  {
    "name": "Beef Pho",
    "calories": 520,
    "protein": 32,
    "carbs": 55,
    "fat": 12,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Beef Pho, a Vietnamese staple, is a fragrant noodle soup with rice noodles, tender beef, and a broth infused with star anise and ginger. Served with fresh herbs, bean sprouts, and chili, it’s a protein-rich, aromatic dish. Its complex flavors and nourishing qualities make it a global favorite for comforting meals."
  },
  {
    "name": "Pineapple",
    "calories": 50,
    "protein": 0.5,
    "carbs": 13,
    "fat": 0.1,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Pineapple, a juicy tropical fruit, is packed with vitamin C, manganese, and enzymes like bromelain. Its sweet-tangy flavor is perfect for snacking, smoothies, or grilling. Grown in tropical regions, it’s a refreshing, healthy treat that supports digestion and adds vibrancy to any dish."
  },
  {
    "name": "Falafel",
    "calories": 300,
    "protein": 13,
    "carbs": 30,
    "fat": 15,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Falafel, a Middle Eastern specialty, features crispy, deep-fried balls of ground chickpeas, herbs, and spices. Served in pita with tahini and vegetables, it’s a protein-rich, vegetarian dish. Its crunchy exterior and flavorful interior make it a popular street food, loved for its satisfying, plant-based goodness."
  },
  {
    "name": "Garlic",
    "calories": 149,
    "protein": 6,
    "carbs": 33,
    "fat": 0.5,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Garlic, a pungent bulb, is a flavor powerhouse used in cuisines worldwide, from Italian to Asian dishes. Rich in antioxidants and allicin, it supports immunity and heart health. Whether minced, roasted, or sautéed, garlic adds depth and aroma to sauces, stir-fries, and countless recipes."
  },
  {
    "name": "Caprese Salad",
    "calories": 250,
    "protein": 10,
    "carbs": 10,
    "fat": 20,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Caprese salad, an Italian classic, features fresh mozzarella, ripe tomatoes, basil, and a drizzle of olive oil and balsamic vinegar. Its simple, vibrant ingredients highlight the flavors of Italy. Light yet satisfying, it’s a perfect starter or side dish, offering a balance of protein, fats, and fresh taste."
  },
  {
    "name": "Black Beans",
    "calories": 132,
    "protein": 9,
    "carbs": 24,
    "fat": 0.5,
    "type": "ingredient",
    "unit": "100g",
    "imageUrl": "",
    "description": "Black beans, a staple in Latin American cuisine, are rich in protein, fiber, and iron. Their earthy flavor is perfect for soups, burritos, or salads. Versatile and nutritious, they’re a key ingredient in vegetarian and vegan diets, adding heartiness and nutrition to a variety of dishes."
  },
  {
    "name": "French Toast",
    "calories": 400,
    "protein": 12,
    "carbs": 50,
    "fat": 15,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "French toast, a breakfast favorite, features bread soaked in egg and milk, then fried until golden and topped with syrup or fruit. Its soft, custardy texture and sweet flavor make it a comforting dish in Western cuisine. High in carbs and protein, it’s a delicious start to the day."
  },
  {
    "name": "Raspberries",
    "calories": 52,
    "protein": 1.2,
    "carbs": 12,
    "fat": 0.7,
    "type": "snack",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Raspberries, tart and juicy, are packed with fiber, vitamin C, and antioxidants. Perfect for snacking, smoothies, or desserts, their vibrant flavor is a global favorite. Grown in temperate regions, they support heart health and add a burst of freshness to any dish or snack."
  },
  {
    "name": "Miso Soup",
    "calories": 100,
    "protein": 6,
    "carbs": 10,
    "fat": 4,
    "type": "dish",
    "unit": "1 serving",
    "imageUrl": "",
    "description": "Miso soup, a Japanese staple, features a savory broth made from fermented soybean paste, with tofu, seaweed, and scallions. Its umami flavor and light texture make it a perfect starter or side. Rich in probiotics and protein, it’s a healthy, warming dish enjoyed in Asian cuisine."
  }
]